## working text data

## .strip() .lstrip() .rstrip() methods

In [1]:
import pandas as pd
chicago = pd.read_csv('./data/chicago.csv').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category') 
chicago['Position Title'] = chicago['Position Title'].astype('category') 
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [2]:
print("    Hello world   ".strip())
print("    Hello world   ".lstrip())
print("    Hello world   ".rstrip())

Hello world
Hello world
    Hello world

In [3]:
for col in chicago.columns:
    chicago[col] = chicago[col].str.strip()

## string methods on index and columns

In [4]:
chicago = pd.read_csv('./data/chicago.csv', index_col="Name").dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category') 
chicago['Position Title'] = chicago['Position Title'].astype('category') 
chicago.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [5]:
chicago.index = chicago.index.str.strip().str.title()
chicago.columns = chicago.columns.str.strip().str.upper()
chicago.head()

,POSITION TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

## .split() method

In [6]:
"Hello my name is Piotr".split(" ")

['Hello', 'my', 'name', 'is', 'Piotr']

In [7]:
chicago = pd.read_csv('./data/chicago.csv', index_col="Name").dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category') 
chicago['Position Title'] = chicago['Position Title'].astype('category') 
chicago = chicago.reset_index()

In [8]:
firstNames = chicago['Name'].str.split(',').str.get(0)
lastNames = chicago['Name'].str.split(',').str.get(1)
chicago['First Name'] = firstNames
chicago['Last Name'] = lastNames
chicago.head()
chicago['First Name'].str.title().value_counts()

Williams         293
Johnson          244
Smith            241
Brown            185
Jones            183
Rodriguez        171
Jackson          136
Garcia           130
Davis            127
Hernandez        110
Martinez         108
Lopez            106
Gonzalez         104
Perez            100
Wilson            94
Rivera            90
Thomas            89
Anderson          82
Torres            81
Murphy            80
Robinson          79
Moore             78
Harris            76
Sanchez           76
Miller            75
Lewis             74
Taylor            73
Martin            72
Clark             66
White             66
                ...
Andrews Jr         1
Liggins            1
Prachand           1
Dolibois           1
Mc Ginty           1
Needham            1
Roseburr           1
Acres              1
Igwe               1
Bertram            1
Mackin             1
Lefevour           1
Annunzio           1
Marrella           1
Jessup             1
Del Campo          1
Martinek           1
Alcozer            1
Fiala              1
Cato Iii           1
Segal              1
Gilliana           1
Judevine           1
Jackson Woods      1
Moses Hughes       1
Moore Ashton       1
Szczygiel          1
Cunningham Jr      1
Dyess              1
O'Dea              1
Name: First Name, Length: 13829, dtype: int64

In [9]:
chicago['Position Title'].str.split(" ").str.get(0).str.title().value_counts()

Police                   10856
Firefighter-Emt           1509
Sergeant                  1186
Pool                       918
Firefighter                810
Crossing                   775
Motor                      721
Sanitation                 715
Paramedic                  641
Asst                       606
Fire                       512
Traffic                    512
Senior                     470
Construction               452
Lieutenant-Emt             394
Administrative             375
Library                    365
Librarian                  335
Lieutenant                 332
Operating                  324
Electrical                 313
Aviation                   309
Firefighter/Paramedic      259
General                    257
Staff                      250
Clerk                      242
Foreman                    237
Hoisting                   214
Deputy                     213
Machinist                  210
                         ...
Caps                         1
Photographer                 1
Subpoena                     1
Analyst                      1
Manager-Fleet                1
Hate                         1
Deck                         1
Intake                       1
Supt                         1
Supervisor                   1
Criminalist                  1
Glazier                      1
Commander-Paramedic          1
Asbestos                     1
Mobile                       1
Commanding                   1
Superintendent'S             1
Printer                      1
Development                  1
Telecommunications           1
Chairperson                  1
Equal                        1
Manager-O'Hare               1
Loan                         1
Offset                       1
Inspector                    1
Veterinarian-Hourly          1
Telephone                    1
Leasing                      1
Portfolio                    1
Name: Position Title, Length: 320, dtype: int64

## .split() practice

In [11]:
chicago = pd.read_csv('./data/chicago.csv').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category') 
chicago['Position Title'] = chicago['Position Title'].astype('category') 
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

### find 5 most common names in data set

In [17]:
chicago['Name'].str.split(",").str.get(1).str.strip().str.split(" ").str.get(0).value_counts().head(5)

MICHAEL    1153
JOHN        899
JAMES       676
ROBERT      622
JOSEPH      537
Name: Name, dtype: int64

## the `expand` and `n` parameters in `.split()` method

In [22]:
chicago['Position Title'].str.split(" ", expand=True, n=1)

                           0                                  1
0                      WATER                         RATE TAKER
1                     POLICE                            OFFICER
2                     POLICE                            OFFICER
3                      CHIEF                 CONTRACT EXPEDITER
4                      CIVIL                        ENGINEER IV
5                       ASST                    TO THE ALDERMAN
6                    GENERAL                      LABORER - DSS
7                    TRAFFIC                CONTROL AIDE-HOURLY
8                      STAFF               ASST TO THE ALDERMAN
9                 ELECTRICAL                           MECHANIC
10                      FIRE                       ENGINEER-EMT
11                    POLICE                            OFFICER
12                    FOSTER                        GRANDPARENT
13                     CLERK                                III
14              INVESTIGATOR                          - IPRA II
15                    POLICE                            OFFICER
16                    POLICE                            OFFICER
17               FIREFIGHTER  (PER ARBITRATORS AWARD)-PARAMEDIC
18                    POLICE                            OFFICER
19     FIREFIGHTER/PARAMEDIC                               None
20               ENGINEERING                      TECHNICIAN VI
21           FIREFIGHTER-EMT                               None
22                LIEUTENANT                               None
23                  CROSSING                              GUARD
24                ELECTRICAL       MECHANIC-AUTO-POLICE MTR MNT
25                     CIVIL                        ENGINEER II
26                   GENERAL                      LABORER - DSS
27                    FOSTER                        GRANDPARENT
28                    POLICE                            OFFICER
29                 PARAMEDIC                               None
...                      ...                                ...
32032                 GARAGE                          ATTENDANT
32033                 POLICE                            OFFICER
32034                 POLICE                            OFFICER
32035                 POLICE                            OFFICER
32036                GENERAL                      LABORER - DSS
32037        FIREFIGHTER-EMT                               None
32038                LABORER                       - APPRENTICE
32039         LIEUTENANT-EMT                               None
32040                 POLICE                            OFFICER
32041               CROSSING                              GUARD
32042                    FRM         OF MACHINISTS - AUTOMOTIVE
32043             SANITATION                            LABORER
32044                 POLICE                            OFFICER
32045             ELECTRICAL                           MECHANIC
32046                 SENIOR         PUBLIC INFORMATION OFFICER
32047                 POLICE                            OFFICER
32048                  LEGAL                          SECRETARY
32049               CROSSING                              GUARD
32050                   POOL                 MOTOR TRUCK DRIVER
32051                AIRPORT                OPERATIONS SUPVSR I
32052                 POLICE                            OFFICER
32053        FIREFIGHTER-EMT                               None
32054                 POLICE                            OFFICER
32055                 POLICE                            OFFICER
32056              MACHINIST                       (AUTOMOTIVE)
32057                    FRM         OF MACHINISTS - AUTOMOTIVE
32058                 POLICE                            OFFICER
32059                 POLICE                            OFFICER
32060                 POLICE                            OFFICER
32061                  CHIEF                  DATA BASE ANALYST

[32062 rows x 2 columns]